РП/src/Tasks/БюджетнаяЗадача/БюджетнаяЗадача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>БюджетнаяЗадача</name>
  <addressing>InformationRegister.ИсполнителиЗадач</addressing>
  <attributes>
    <name>МодельБюджетирования</name>
    <type>
      <types>CatalogRef.МоделиБюджетирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПодготовкиБюджетов</name>
    <type>
      <types>CatalogRef.ЭтапыПодготовкиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Действие</name>
    <type>
      <types>EnumRef.ТипыДействийЭтаповПодготовкиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаДействия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсполнения</name>
    <comment>Дата и время фактического выполнения задачи</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>Плановый срок исполнения задачи</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗадачи</name>
    <comment>Описание постановки задачи для исполнителя</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЗадача</name>
    <type>
      <types>TaskRef.БюджетнаяЗадача</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныйЭтапПодготовкиБюджетов</name>
    <type>
      <types>CatalogRef.ЭтапыПодготовкиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <comment>Автор бизнес-процесса, который сформировал задачу</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиКонтрольныхОтчетов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПовторяемыйЭтапПодготовкиБюджетов</name>
    <type>
      <types>CatalogRef.ЭтапыПодготовкиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцессПодготовкиБюджетов</name>
    <type>
      <types>DocumentRef.ПроцессПодготовкиБюджетов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УтверждаемыеДокументы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПланЗакупок</types>
        <types>DocumentRef.ПланПродаж</types>
        <types>DocumentRef.ЭкземплярБюджета</types>
        <types>String</types>
        <types>DocumentRef.ПланСборкиРазборки</types>
        <types>DocumentRef.ПланПроизводства</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапПодготовкиБюджетов</name>
      <type>
        <types>CatalogRef.ЭтапыПодготовкиБюджетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокДокументов</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПланЗакупок</types>
        <types>DocumentRef.ПланПродаж</types>
        <types>DocumentRef.УстановкаЗначенийНефинансовыхПоказателей</types>
        <types>DocumentRef.ЭкземплярБюджета</types>
        <types>DocumentRef.ЛимитыРасходаДенежныхСредств</types>
        <types>DocumentRef.ПланСборкиРазборки</types>
        <types>DocumentRef.ПланПроизводства</types>
      </type>
    </attributes>
  </tabularSections>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

РП/src/Tasks/БюджетнаяЗадача/Forms/ФормированиеСвязаннойЗадачи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ВыбиратьИсполнителя = Параметры.ВыбиратьИсполнителя;
	ВыбиратьЭтапПодготовкиБюджетов = Параметры.ВыбиратьЭтапПодготовкиБюджетов;
	МодельБюджетирования = Параметры.МодельБюджетирования;
	
	Если Параметры.ФормированиеНесколькихЗадач Тогда
		ЗаголовокФормы = НСтр("ru='Формирование связанных задач';uk='Формування пов''язаних задач'");
		ЗаголовокСформироватьЗадачу = НСтр("ru='Сформировать задачи';uk='Сформувати задачі'");
		ЗаголовокНеФормироватьЗадачу = НСтр("ru='Не формировать задачи';uk='Не формувати задачі'");
		ЗаголовокГруппаВыборШагаПроцесса = НСтр("ru='Создать задачи в рамках';uk='Створити задачі в рамках'")
	Иначе
		ЗаголовокФормы = НСтр("ru='Формирование связанной задачи';uk='Формування пов''язаної задачі'");
		ЗаголовокСформироватьЗадачу = НСтр("ru='Сформировать задачу';uk='Сформувати задачу'");
		ЗаголовокНеФормироватьЗадачу = НСтр("ru='Не формировать задачу';uk='Не формувати задачі'");
		ЗаголовокГруппаВыборШагаПроцесса = НСтр("ru='Создать задачу в рамках';uk='Створити задачу в межах'")
	КонецЕсли;
	
	ЭтаФорма.Заголовок = ?(Не ПустаяСтрока(Параметры.ЗаголовокФормы), Параметры.ЗаголовокФормы, ЗаголовокФормы);
	Элементы.СформироватьЗадачу.Заголовок = ЗаголовокСформироватьЗадачу;
	Элементы.НеФормироватьЗадачу.Заголовок = ЗаголовокНеФормироватьЗадачу;
	Элементы.ГруппаВыборШагаПроцесса.Заголовок = ЗаголовокГруппаВыборШагаПроцесса;
	
	Элементы.ГруппаВыборШагаПроцесса.Видимость = ВыбиратьЭтапПодготовкиБюджетов;
	Элементы.Исполнитель.Видимость = ВыбиратьИсполнителя;
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(СрокИсполнения) И НачалоДня(СрокИсполнения) < НачалоДня(ТекущаяДата()) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Срок исполнения задачи не может быть меньше текущей даты';uk='Строк виконання задачі не може бути менше поточної дати'"), , , "СрокИсполнения", Отказ);
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ВариантВыбораЭтапПодготовкиБюджетов = 0 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ЭтапПодготовкиБюджетов");
	КонецЕсли;
	
	Если Не ВыбиратьИсполнителя Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Исполнитель");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЭтапПодготовкиБюджетовТекущийПриИзменении(Элемент)
	
	ЭтапПодготовкиБюджетов = Неопределено;
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапПодготовкиБюджетовВыбранныйПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьЗадачу(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура("Наименование, СрокИсполнения, ОписаниеЗадачи");
	Если ВыбиратьИсполнителя Тогда
		Результат.Вставить("Исполнитель");
	КонецЕсли;
	Если ВариантВыбораЭтапПодготовкиБюджетов Тогда
		Результат.Вставить("ЭтапПодготовкиБюджетов");
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура НеФормироватьЗадачу(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	
	Элементы.ЭтапПодготовкиБюджетов.Доступность = (ВариантВыбораЭтапПодготовкиБюджетов = 1);
	Элементы.ЭтапПодготовкиБюджетов.АвтоОтметкаНезаполненного = (ВариантВыбораЭтапПодготовкиБюджетов = 1);
	
КонецПроцедуры


#КонецОбласти
